#pragma once

/**
 * Name: Dreadnought
 * Version: Latest
 */

#include "../SDK.h"

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function DreadGameUI.AsyncTaskDownloadEula.DownloadEula
	 */
	struct UAsyncTaskDownloadEula_DownloadEula_Params
	{
	public:
		class UAsyncTaskDownloadEula*                              ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction DreadGameUI.BattleReadinessInterpreter.OnBattleReadinessPurchaseApproved__DelegateSignature
	 */
	struct UBattleReadinessInterpreter_OnBattleReadinessPurchaseApproved__DelegateSignature_Params
	{
	public:
		bool                                                       purchaseSuccessful;                                      // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.CareerProgressionInterpreter.OnCareerProgressionPinnedGoalChanged
	 */
	struct UCareerProgressionInterpreter_OnCareerProgressionPinnedGoalChanged_Params
	{
	public:
		class FName                                                newPinnedGoalId;                                         // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.CareerProgressionInterpreter.OnCareerProgressionGoalStageUpdated
	 */
	struct UCareerProgressionInterpreter_OnCareerProgressionGoalStageUpdated_Params
	{
	public:
		class FName                                                goalId;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FYUICareerProgressionGoalStageData                  newStage;                                                // 0x0008(0x0218)  (Parm, NativeAccessSpecifierPublic)
		bool                                                       bHasUIListBeenSorted;                                    // 0x0220(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.CareerProgressionInterpreter.OnCareerProgressionGoalStageRewardUpdated
	 */
	struct UCareerProgressionInterpreter_OnCareerProgressionGoalStageRewardUpdated_Params
	{
	public:
		class FName                                                goalId;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bSucceeded;                                              // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_IJTG[0x7];                                   // 0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FString                                              message;                                                 // 0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.CareerProgressionInterpreter.OnCareerProgressionCategoryUnlocked
	 */
	struct UCareerProgressionInterpreter_OnCareerProgressionCategoryUnlocked_Params
	{
	public:
		EYGoalCategory                                             unlockedCategory;                                        // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction DreadGameUI.ChatInterpreter.OnChatMessagesChangedDelegate__DelegateSignature
	 */
	struct UChatInterpreter_OnChatMessagesChangedDelegate__DelegateSignature_Params
	{	};

	/**
	 * DelegateFunction DreadGameUI.ChatInterpreter.OnChatChannelAddedDelegate__DelegateSignature
	 */
	struct UChatInterpreter_OnChatChannelAddedDelegate__DelegateSignature_Params
	{	};

	/**
	 * Function DreadGameUI.ContractsInterpreter.HandleOnPlayerContractsUpdated
	 */
	struct UContractsInterpreter_HandleOnPlayerContractsUpdated_Params
	{	};

	/**
	 * Function DreadGameUI.PopupButtonData.SetPS4ButtonIconMapping
	 */
	struct UPopupButtonData_SetPS4ButtonIconMapping_Params
	{
	public:
		EYPS4ButtonIcon                                            buttonIconType;                                          // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.PopupButtonData.SetLabel
	 */
	struct UPopupButtonData_SetLabel_Params
	{
	public:
		class FText                                                label;                                                   // 0x0000(0x0018)  (ConstParm, Parm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.PopupButtonData.SetIndex
	 */
	struct UPopupButtonData_SetIndex_Params
	{
	public:
		int32_t                                                    index;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.PopupButtonData.SetCurrencyType
	 */
	struct UPopupButtonData_SetCurrencyType_Params
	{
	public:
		EYUICurrency                                               currencyType;                                            // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.PopupButtonData.SetCurrencyAmountStringText
	 */
	struct UPopupButtonData_SetCurrencyAmountStringText_Params
	{
	public:
		class FText                                                currencyAmountStrText;                                   // 0x0000(0x0018)  (ConstParm, Parm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.PopupButtonData.SetButtonColor
	 */
	struct UPopupButtonData_SetButtonColor_Params
	{
	public:
		struct FLinearColor                                        Color;                                                   // 0x0000(0x0010)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.PopupButtonData.IsCurrencyEnabled
	 */
	struct UPopupButtonData_IsCurrencyEnabled_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.PopupButtonData.IsButtonColorCustom
	 */
	struct UPopupButtonData_IsButtonColorCustom_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.PopupButtonData.HasPS4ButtonIconMapping
	 */
	struct UPopupButtonData_HasPS4ButtonIconMapping_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.PopupButtonData.GetPS4ButtonIconMapping
	 */
	struct UPopupButtonData_GetPS4ButtonIconMapping_Params
	{
	public:
		EYPS4ButtonIcon                                            ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.PopupButtonData.GetLabel
	 */
	struct UPopupButtonData_GetLabel_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.PopupButtonData.GetIndex
	 */
	struct UPopupButtonData_GetIndex_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.PopupButtonData.GetCustomButtonColor
	 */
	struct UPopupButtonData_GetCustomButtonColor_Params
	{
	public:
		struct FLinearColor                                        ReturnValue;                                             // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.PopupButtonData.GetCurrencyType
	 */
	struct UPopupButtonData_GetCurrencyType_Params
	{
	public:
		EYUICurrency                                               ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.PopupButtonData.GetCurrencyAmountStringText
	 */
	struct UPopupButtonData_GetCurrencyAmountStringText_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.PopupManager.SetDefaultWebPopupWidgetClass
	 */
	struct UPopupManager_SetDefaultWebPopupWidgetClass_Params
	{
	public:
		class UClass*                                              userWidgetClass;                                         // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.PopupManager.SetDefaultUpsellPopupWidgetClass
	 */
	struct UPopupManager_SetDefaultUpsellPopupWidgetClass_Params
	{
	public:
		class UClass*                                              userWidgetClass;                                         // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.PopupManager.SetDefaultLoginStreakPopupWidgetClass
	 */
	struct UPopupManager_SetDefaultLoginStreakPopupWidgetClass_Params
	{
	public:
		class UClass*                                              userWidgetClass;                                         // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.PopupManager.SetDefaultGenericPopupWidgetClass
	 */
	struct UPopupManager_SetDefaultGenericPopupWidgetClass_Params
	{
	public:
		class UClass*                                              userWidgetClass;                                         // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.PopupManager.OnPopupButtonSelected
	 */
	struct UPopupManager_OnPopupButtonSelected_Params
	{
	public:
		class UUserWidget*                                         popupWidget;                                             // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    ButtonIndex;                                             // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.PopupManager.IsPopupDisplayed
	 */
	struct UPopupManager_IsPopupDisplayed_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.PopupManager.GetCurrentPopupData
	 */
	struct UPopupManager_GetCurrentPopupData_Params
	{
	public:
		class UPopupData*                                          ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.PopupManager.GetCurrentPopup
	 */
	struct UPopupManager_GetCurrentPopup_Params
	{
	public:
		class UUserWidget*                                         ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.PopupManager.ClosePopup
	 */
	struct UPopupManager_ClosePopup_Params
	{
	public:
		class UUserWidget*                                         popupWidget;                                             // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.PopupManager.CloseCurrentPopup
	 */
	struct UPopupManager_CloseCurrentPopup_Params
	{	};

	/**
	 * Function DreadGameUI.PopupManager.CloseAllPopups
	 */
	struct UPopupManager_CloseAllPopups_Params
	{	};

	/**
	 * Function DreadGameUI.PopupManager.AddWebPopup
	 */
	struct UPopupManager_AddWebPopup_Params
	{
	public:
		class FString                                              webURL;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FPopupStackData                                     ReturnValue;                                             // 0x0010(0x0090)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.PopupManager.AddUpsellPopup
	 */
	struct UPopupManager_AddUpsellPopup_Params
	{
	public:
		class UPopupUpsellData*                                    upsellData;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_8P44[0x8];                                   // 0x0008(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FPopupStackData                                     ReturnValue;                                             // 0x0010(0x0090)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.PopupManager.AddGenericPopupFromButtonDataList
	 */
	struct UPopupManager_AddGenericPopupFromButtonDataList_Params
	{
	public:
		class UClass*                                              userWidgetClass;                                         // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FText                                                titleText;                                               // 0x0008(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		class FText                                                bodyText;                                                // 0x0020(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		TArray<class UPopupButtonData*>                            buttons;                                                 // 0x0038(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_KNGT[0x8];                                   // 0x0048(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FPopupStackData                                     ReturnValue;                                             // 0x0050(0x0090)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.PopupManager.AddGenericPopup
	 */
	struct UPopupManager_AddGenericPopup_Params
	{
	public:
		class UClass*                                              userWidgetClass;                                         // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FText                                                titleText;                                               // 0x0008(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		class FText                                                bodyText;                                                // 0x0020(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		TArray<class FText>                                        buttonTexts;                                             // 0x0038(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_7WFU[0x8];                                   // 0x0048(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FPopupStackData                                     ReturnValue;                                             // 0x0050(0x0090)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.PopupManager.AddCustomPopup
	 */
	struct UPopupManager_AddCustomPopup_Params
	{
	public:
		class UClass*                                              userWidgetClass;                                         // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UPopupData*                                          PopupData;                                               // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FPopupStackData                                     ReturnValue;                                             // 0x0010(0x0090)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.MarketInterpreter.OnPaywallUrlReceived
	 */
	struct UMarketInterpreter_OnPaywallUrlReceived_Params
	{
	public:
		class FString                                              URL;                                                     // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              transactionId;                                           // 0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction DreadGameUI.MarketInterpreter.OnMarketPurchaseComplete__DelegateSignature
	 */
	struct UMarketInterpreter_OnMarketPurchaseComplete__DelegateSignature_Params
	{
	public:
		EYPurchaseResult                                           purchaseResult;                                          // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction DreadGameUI.MarketInterpreter.OnMarketDataRebuilt__DelegateSignature
	 */
	struct UMarketInterpreter_OnMarketDataRebuilt__DelegateSignature_Params
	{	};

	/**
	 * DelegateFunction DreadGameUI.MarketInterpreter.OnMarketCatalogUpdated__DelegateSignature
	 */
	struct UMarketInterpreter_OnMarketCatalogUpdated__DelegateSignature_Params
	{	};

	/**
	 * Function DreadGameUI.MarketInterpreter.MarketPurchaseComplete
	 */
	struct UMarketInterpreter_MarketPurchaseComplete_Params
	{
	public:
		int32_t                                                    purchaseResult;                                          // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_RNO9[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FString                                              offerId;                                                 // 0x0008(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    quantity;                                                // 0x0018(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.MarketInterpreter.MarketManifestInitialized
	 */
	struct UMarketInterpreter_MarketManifestInitialized_Params
	{	};

	/**
	 * Function DreadGameUI.MarketInterpreter.MarketDataRebuilt
	 */
	struct UMarketInterpreter_MarketDataRebuilt_Params
	{	};

	/**
	 * Function DreadGameUI.MarketInterpreter.MarketCatalogUpdated
	 */
	struct UMarketInterpreter_MarketCatalogUpdated_Params
	{	};

	/**
	 * Function DreadGameUI.MarketInterpreter.HandlePlayerConversionRequestDone
	 */
	struct UMarketInterpreter_HandlePlayerConversionRequestDone_Params
	{
	public:
		bool                                                       Result;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.NotificationData.SetIsNew
	 */
	struct UNotificationData_SetIsNew_Params
	{
	public:
		bool                                                       Value;                                                   // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.NotificationData.IsNew
	 */
	struct UNotificationData_IsNew_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.NotificationData.GetType
	 */
	struct UNotificationData_GetType_Params
	{
	public:
		EYAnnouncementType                                         ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.NotificationData.GetText
	 */
	struct UNotificationData_GetText_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.NotificationData.GetNumButtons
	 */
	struct UNotificationData_GetNumButtons_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.NotificationData.GetID
	 */
	struct UNotificationData_GetID_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.NotificationData.GetButtons
	 */
	struct UNotificationData_GetButtons_Params
	{
	public:
		TArray<ENotificationButtonType>                            ReturnValue;                                             // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction DreadGameUI.NotificationsInterpreter.OnAnnouncementsChanged__DelegateSignature
	 */
	struct UNotificationsInterpreter_OnAnnouncementsChanged__DelegateSignature_Params
	{	};

	/**
	 * Function DreadGameUI.NotificationsInterpreter.HandleOnAnnouncementsChanged
	 */
	struct UNotificationsInterpreter_HandleOnAnnouncementsChanged_Params
	{	};

	/**
	 * Function DreadGameUI.OnboardingInterpreter.OnFleetUnlocked
	 */
	struct UOnboardingInterpreter_OnFleetUnlocked_Params
	{
	public:
		EYFleetType                                                fleetType;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_DreadWidget.SetUITheme
	 */
	struct UUI_DreadWidget_SetUITheme_Params
	{
	public:
		EUI_Theme                                                  theme;                                                   // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_DreadWidget.SendAnalyticsEvent
	 */
	struct UUI_DreadWidget_SendAnalyticsEvent_Params
	{
	public:
		EUI_Screen                                                 screenId;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EAnalyticsButtonId                                         buttonID;                                                // 0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_VZK2[0x2];                                   // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    granularId;                                              // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_DreadWidget.OnUIThemeReceived
	 */
	struct UUI_DreadWidget_OnUIThemeReceived_Params
	{
	public:
		EUI_Theme                                                  theme;                                                   // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_DreadWidget.OnSynchronizeProperties
	 */
	struct UUI_DreadWidget_OnSynchronizeProperties_Params
	{	};

	/**
	 * Function DreadGameUI.UI_DreadWidget.OnActionReceived
	 */
	struct UUI_DreadWidget_OnActionReceived_Params
	{	};

	/**
	 * Function DreadGameUI.UI_DreadWidget.NavigateToTab
	 */
	struct UUI_DreadWidget_NavigateToTab_Params
	{
	public:
		EUI_Screen                                                 screen;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_DreadWidget.NavigateToScreen
	 */
	struct UUI_DreadWidget_NavigateToScreen_Params
	{
	public:
		EUI_Screen                                                 screen;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_DreadWidget.NavigateToPreviousScreen
	 */
	struct UUI_DreadWidget_NavigateToPreviousScreen_Params
	{	};

	/**
	 * Function DreadGameUI.UI_DreadWidget.IsPlatform
	 */
	struct UUI_DreadWidget_IsPlatform_Params
	{
	public:
		EPlatform                                                  platform;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_DreadWidget.IsCurrentShipOwned
	 */
	struct UUI_DreadWidget_IsCurrentShipOwned_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_DreadWidget.IsCurrentModuleAVanityItem
	 */
	struct UUI_DreadWidget_IsCurrentModuleAVanityItem_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_DreadWidget.HandleAction
	 */
	struct UUI_DreadWidget_HandleAction_Params
	{	};

	/**
	 * Function DreadGameUI.UI_DreadWidget.GetViewportPosition
	 */
	struct UUI_DreadWidget_GetViewportPosition_Params
	{
	public:
		struct FVector2D                                           ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_DreadWidget.GetUIDataForItemId
	 */
	struct UUI_DreadWidget_GetUIDataForItemId_Params
	{
	public:
		int32_t                                                    itemID;                                                  // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_N62L[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FYItemUIData                                        ReturnValue;                                             // 0x0008(0x00D0)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_DreadWidget.GetTooltipDataForItemData
	 */
	struct UUI_DreadWidget_GetTooltipDataForItemData_Params
	{
	public:
		struct FYUIShipTechTreeItemData                            itemData;                                                // 0x0000(0x0158)  (Parm, NativeAccessSpecifierPublic)
		TArray<struct FYToolTipValue>                              ReturnValue;                                             // 0x0158(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_DreadWidget.GetImageLoader
	 */
	struct UUI_DreadWidget_GetImageLoader_Params
	{
	public:
		class UYImageLoader*                                       ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_DreadWidget.GetCachedAbsolutePosition
	 */
	struct UUI_DreadWidget_GetCachedAbsolutePosition_Params
	{
	public:
		struct FVector2D                                           ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_DreadWidget.DoesCurrentModuleHaveItemOffer
	 */
	struct UUI_DreadWidget_DoesCurrentModuleHaveItemOffer_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_GenericButtonModuleWidget.ShouldShowTierIcon
	 */
	struct UUI_GenericButtonModuleWidget_ShouldShowTierIcon_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_GenericButtonModuleWidget.ShouldShowPreviousCost
	 */
	struct UUI_GenericButtonModuleWidget_ShouldShowPreviousCost_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_GenericButtonModuleWidget.ShouldShowNewTag
	 */
	struct UUI_GenericButtonModuleWidget_ShouldShowNewTag_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_GenericButtonModuleWidget.ShouldShowLockIcon
	 */
	struct UUI_GenericButtonModuleWidget_ShouldShowLockIcon_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_GenericButtonModuleWidget.ShouldShowDiscountTag
	 */
	struct UUI_GenericButtonModuleWidget_ShouldShowDiscountTag_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_GenericButtonModuleWidget.ShouldShowCurrentCost
	 */
	struct UUI_GenericButtonModuleWidget_ShouldShowCurrentCost_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_GenericButtonModuleWidget.SetDataStruct
	 */
	struct UUI_GenericButtonModuleWidget_SetDataStruct_Params
	{
	public:
		struct FUIGenericButtonModuleData                          Data;                                                    // 0x0000(0x00C0)  (Parm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_GenericButtonModuleWidget.IsTechTreeItemAndNotOwned
	 */
	struct UUI_GenericButtonModuleWidget_IsTechTreeItemAndNotOwned_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_GenericButtonModuleWidget.IsOwned
	 */
	struct UUI_GenericButtonModuleWidget_IsOwned_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_GenericButtonModuleWidget.IsOnSale
	 */
	struct UUI_GenericButtonModuleWidget_IsOnSale_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_GenericButtonModuleWidget.IsNew
	 */
	struct UUI_GenericButtonModuleWidget_IsNew_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_GenericButtonModuleWidget.IsEquipped
	 */
	struct UUI_GenericButtonModuleWidget_IsEquipped_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_GenericButtonModuleWidget.IsCurrentModuleAVanityItem
	 */
	struct UUI_GenericButtonModuleWidget_IsCurrentModuleAVanityItem_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_GenericButtonModuleWidget.HasPriceDiscount
	 */
	struct UUI_GenericButtonModuleWidget_HasPriceDiscount_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_GenericButtonModuleWidget.GetTier
	 */
	struct UUI_GenericButtonModuleWidget_GetTier_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_GenericButtonModuleWidget.GetTechTreeResearchPrice
	 */
	struct UUI_GenericButtonModuleWidget_GetTechTreeResearchPrice_Params
	{
	public:
		struct FYUIItemPriceData                                   ReturnValue;                                             // 0x0000(0x0030)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_GenericButtonModuleWidget.GetTechTreePurchasePrice
	 */
	struct UUI_GenericButtonModuleWidget_GetTechTreePurchasePrice_Params
	{
	public:
		struct FYUIItemPriceData                                   ReturnValue;                                             // 0x0000(0x0030)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_GenericButtonModuleWidget.GetTechTreeItemState
	 */
	struct UUI_GenericButtonModuleWidget_GetTechTreeItemState_Params
	{
	public:
		EYTechTreeItemState                                        ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_GenericButtonModuleWidget.GetPriceCurrency
	 */
	struct UUI_GenericButtonModuleWidget_GetPriceCurrency_Params
	{
	public:
		EYUICurrency                                               ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_GenericButtonModuleWidget.GetPriceAmount
	 */
	struct UUI_GenericButtonModuleWidget_GetPriceAmount_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_GenericButtonModuleWidget.GetOriginalPriceCurrency
	 */
	struct UUI_GenericButtonModuleWidget_GetOriginalPriceCurrency_Params
	{
	public:
		EYUICurrency                                               ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_GenericButtonModuleWidget.GetOriginalPriceAmount
	 */
	struct UUI_GenericButtonModuleWidget_GetOriginalPriceAmount_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_GenericButtonModuleWidget.GetNewPriceAsPercentOfOldPrice
	 */
	struct UUI_GenericButtonModuleWidget_GetNewPriceAsPercentOfOldPrice_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_GenericButtonModuleWidget.GetModuleTexturePath
	 */
	struct UUI_GenericButtonModuleWidget_GetModuleTexturePath_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_GenericButtonModuleWidget.GetModuleName
	 */
	struct UUI_GenericButtonModuleWidget_GetModuleName_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_GenericButtonModuleWidget.GetItemID
	 */
	struct UUI_GenericButtonModuleWidget_GetItemID_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_GenericButtonModuleWidget.GetIndex
	 */
	struct UUI_GenericButtonModuleWidget_GetIndex_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_GenericButtonModuleWidget.GetIconTexturePath
	 */
	struct UUI_GenericButtonModuleWidget_GetIconTexturePath_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_GenericButtonModuleWidget.GetDiscountTagText
	 */
	struct UUI_GenericButtonModuleWidget_GetDiscountTagText_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_GenericButtonModuleWidget.GetDataStruct
	 */
	struct UUI_GenericButtonModuleWidget_GetDataStruct_Params
	{
	public:
		struct FUIGenericButtonModuleData                          ReturnValue;                                             // 0x0000(0x00C0)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_GenericButtonModuleWidget.DoesCurrentModuleHaveItemOffer
	 */
	struct UUI_GenericButtonModuleWidget_DoesCurrentModuleHaveItemOffer_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.YMatchmakingInterpreter.StartQuickPlayMatchmaking
	 */
	struct UYMatchmakingInterpreter_StartQuickPlayMatchmaking_Params
	{	};

	/**
	 * Function DreadGameUI.YMatchmakingInterpreter.StartMatchmaking
	 */
	struct UYMatchmakingInterpreter_StartMatchmaking_Params
	{
	public:
		EYGameModeType                                             gameModeType;                                            // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_9PEZ[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FString                                              fullMapPath;                                             // 0x0008(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.YMatchmakingInterpreter.StartFavoritesMatchmaking
	 */
	struct UYMatchmakingInterpreter_StartFavoritesMatchmaking_Params
	{
	public:
		TArray<uint32_t>                                           gameModeTypes;                                           // 0x0000(0x0010)  (Parm, ZeroConstructor, NativeAccessSpecifierPublic)
		class FString                                              fullMapPath;                                             // 0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction DreadGameUI.YMatchmakingInterpreter.SquadMatchmakingStartedDelegate__DelegateSignature
	 */
	struct UYMatchmakingInterpreter_SquadMatchmakingStartedDelegate__DelegateSignature_Params
	{	};

	/**
	 * DelegateFunction DreadGameUI.YMatchmakingInterpreter.ServerStartingDelegate__DelegateSignature
	 */
	struct UYMatchmakingInterpreter_ServerStartingDelegate__DelegateSignature_Params
	{	};

	/**
	 * DelegateFunction DreadGameUI.YMatchmakingInterpreter.QueueWaitingTimeAvailableDelegate__DelegateSignature
	 */
	struct UYMatchmakingInterpreter_QueueWaitingTimeAvailableDelegate__DelegateSignature_Params
	{
	public:
		int32_t                                                    waitTimeSeconds;                                         // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction DreadGameUI.YMatchmakingInterpreter.MatchmakingTimerStoppedDelegate__DelegateSignature
	 */
	struct UYMatchmakingInterpreter_MatchmakingTimerStoppedDelegate__DelegateSignature_Params
	{	};

	/**
	 * DelegateFunction DreadGameUI.YMatchmakingInterpreter.MatchmakingTimerStartedDelegate__DelegateSignature
	 */
	struct UYMatchmakingInterpreter_MatchmakingTimerStartedDelegate__DelegateSignature_Params
	{	};

	/**
	 * DelegateFunction DreadGameUI.YMatchmakingInterpreter.MatchmakingFailedDelegate__DelegateSignature
	 */
	struct UYMatchmakingInterpreter_MatchmakingFailedDelegate__DelegateSignature_Params
	{	};

	/**
	 * Function DreadGameUI.YMatchmakingInterpreter.CancelMatchmaking
	 */
	struct UYMatchmakingInterpreter_CancelMatchmaking_Params
	{	};

	/**
	 * DelegateFunction DreadGameUI.YMatchmakingInterpreter.BattleServerShutDownDelegate__DelegateSignature
	 */
	struct UYMatchmakingInterpreter_BattleServerShutDownDelegate__DelegateSignature_Params
	{	};

	/**
	 * DelegateFunction DreadGameUI.HangarPreviewComponent.OnPreviewStarted__DelegateSignature
	 */
	struct UHangarPreviewComponent_OnPreviewStarted__DelegateSignature_Params
	{	};

	/**
	 * DelegateFunction DreadGameUI.HangarPreviewComponent.OnPreviewEnded__DelegateSignature
	 */
	struct UHangarPreviewComponent_OnPreviewEnded__DelegateSignature_Params
	{	};

	/**
	 * Function DreadGameUI.HangarPreviewComponent.HandleOnSubLevelLoaded
	 */
	struct UHangarPreviewComponent_HandleOnSubLevelLoaded_Params
	{	};

	/**
	 * Function DreadGameUI.HangarPreviewComponent.HandleOnPreviewActorLoadoutAsyncLoaded
	 */
	struct UHangarPreviewComponent_HandleOnPreviewActorLoadoutAsyncLoaded_Params
	{
	public:
		class UYShipLoadout*                                       loadout;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.HangarPreviewComponent.HandleOnOutpostTransitionCompleted
	 */
	struct UHangarPreviewComponent_HandleOnOutpostTransitionCompleted_Params
	{
	public:
		EYOutpostSection                                           newSection;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.FrontendHUD.OnHangarStateChanged
	 */
	struct AFrontendHUD_OnHangarStateChanged_Params
	{
	public:
		EHangarState                                               hangarState;                                             // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.FrontendHUD.NavigateToTab
	 */
	struct AFrontendHUD_NavigateToTab_Params
	{
	public:
		EUI_Screen                                                 screen;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.FrontendHUD.NavigateToScreen
	 */
	struct AFrontendHUD_NavigateToScreen_Params
	{
	public:
		EUI_Screen                                                 screen;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.FrontendHUD.LoadHangar
	 */
	struct AFrontendHUD_LoadHangar_Params
	{	};

	/**
	 * Function DreadGameUI.FrontendHUD.HangarScreenTransitioned
	 */
	struct AFrontendHUD_HangarScreenTransitioned_Params
	{
	public:
		EUI_Screen                                                 previousScreen;                                          // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EUI_Screen                                                 newScreen;                                               // 0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.FrontendHUD.HangarPreviewStarted
	 */
	struct AFrontendHUD_HangarPreviewStarted_Params
	{	};

	/**
	 * Function DreadGameUI.FrontendHUD.HangarPreviewEnded
	 */
	struct AFrontendHUD_HangarPreviewEnded_Params
	{	};

	/**
	 * Function DreadGameUI.FrontendHUD.HangarLoadFinished
	 */
	struct AFrontendHUD_HangarLoadFinished_Params
	{	};

	/**
	 * Function DreadGameUI.FrontendHUD.HandleShipPreviewFinalized
	 */
	struct AFrontendHUD_HandleShipPreviewFinalized_Params
	{	};

	/**
	 * Function DreadGameUI.FrontendHUD.HandleOnControllerConnectionChange
	 */
	struct AFrontendHUD_HandleOnControllerConnectionChange_Params
	{
	public:
		bool                                                       isConnected;                                             // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_WSE8[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    userId;                                                  // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    userIndex;                                               // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.FrontendHUD.HandleLogout
	 */
	struct AFrontendHUD_HandleLogout_Params
	{	};

	/**
	 * Function DreadGameUI.FrontendHUD.HandleLogin
	 */
	struct AFrontendHUD_HandleLogin_Params
	{	};

	/**
	 * Function DreadGameUI.FrontendHUD.GetPopupManager
	 */
	struct AFrontendHUD_GetPopupManager_Params
	{
	public:
		class UPopupManager*                                       ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.FrontendHUD.GetImageLoader
	 */
	struct AFrontendHUD_GetImageLoader_Params
	{
	public:
		class UYImageLoader*                                       ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.FrontendHUD.GetCtAManagerInterface
	 */
	struct AFrontendHUD_GetCtAManagerInterface_Params
	{
	public:
		class UYCtAManagerInterface*                               ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.FrontendHUD.CheckLoginStreakPopup
	 */
	struct AFrontendHUD_CheckLoginStreakPopup_Params
	{	};

	/**
	 * Function DreadGameUI.UI_BattleBonusWidget.RegisterListeners
	 */
	struct UUI_BattleBonusWidget_RegisterListeners_Params
	{	};

	/**
	 * Function DreadGameUI.UI_BattleBonusWidget.OnFleetUpdated
	 */
	struct UUI_BattleBonusWidget_OnFleetUpdated_Params
	{
	public:
		bool                                                       Result;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_BattleBonusWidget.OnBattleBonusPurcahsed
	 */
	struct UUI_BattleBonusWidget_OnBattleBonusPurcahsed_Params
	{
	public:
		bool                                                       Result;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_BattleBonusWidget.HasBattleBonus
	 */
	struct UUI_BattleBonusWidget_HasBattleBonus_Params
	{
	public:
		EYFleetType                                                fleetType;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_BattleBonusWidget.GetShipXpBonus
	 */
	struct UUI_BattleBonusWidget_GetShipXpBonus_Params
	{
	public:
		EYFleetType                                                fleetType;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_US6J[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    ReturnValue;                                             // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_BattleBonusWidget.GetFreeXpBonus
	 */
	struct UUI_BattleBonusWidget_GetFreeXpBonus_Params
	{
	public:
		EYFleetType                                                fleetType;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_XFY3[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    ReturnValue;                                             // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_BattleBonusWidget.GetCreditsBonus
	 */
	struct UUI_BattleBonusWidget_GetCreditsBonus_Params
	{
	public:
		EYFleetType                                                fleetType;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_Z2G8[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    ReturnValue;                                             // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_BattleBonusWidget.GetBattleBonusCreditsCost
	 */
	struct UUI_BattleBonusWidget_GetBattleBonusCreditsCost_Params
	{
	public:
		EYFleetType                                                fleetType;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_AOW5[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    ReturnValue;                                             // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGameUI.UI_BattleBonusWidget.GetBattleBonusCooldown
	 */
	struct UUI_BattleBonusWidget_GetBattleBonusCooldown_Params
	{
	public:
