#pragma once

/**
 * Name: Dreadnought
 * Version: Latest
 */

#include "../SDK.h"

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function DreadGame.YImageLoader.IsImageAvailable
	 */
	struct UYImageLoader_IsImageAvailable_Params
	{
	public:
		class FString                                              URL;                                                     // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YImageLoader.GetImageTexture
	 */
	struct UYImageLoader_GetImageTexture_Params
	{
	public:
		class FString                                              URL;                                                     // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UTexture2D*                                          ReturnValue;                                             // 0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YImageLoader.GetImage
	 */
	struct UYImageLoader_GetImage_Params
	{
	public:
		class UObject*                                             WorldContextObject;                                      // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              URL;                                                     // 0x0008(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UYWebImage*                                          ReturnValue;                                             // 0x0018(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.DreadAsyncTaskDownloadImage.DownloadImage
	 */
	struct UDreadAsyncTaskDownloadImage_DownloadImage_Params
	{
	public:
		class UObject*                                             WorldContextObject;                                      // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UYImageLoader*                                       imageLoader;                                             // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              URL;                                                     // 0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UDreadAsyncTaskDownloadImage*                        ReturnValue;                                             // 0x0020(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.IdleKickManager.HandlePlayerActionTaken
	 */
	struct UIdleKickManager_HandlePlayerActionTaken_Params
	{	};

	/**
	 * Function DreadGame.SocialManager.OnStoredPlayersDisplayInformationUpdated
	 */
	struct USocialManager_OnStoredPlayersDisplayInformationUpdated_Params
	{	};

	/**
	 * Function DreadGame.SocialManager.OnPlayerDataAvailable
	 */
	struct USocialManager_OnPlayerDataAvailable_Params
	{	};

	/**
	 * Function DreadGame.Widget_VerticalModuleList.GetYPosFromScrollOffset
	 */
	struct UWidget_VerticalModuleList_GetYPosFromScrollOffset_Params
	{
	public:
		float                                                      scrollOffset;                                            // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      listHieght;                                              // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      itemHeight;                                              // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      listLength;                                              // 0x000C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      ReturnValue;                                             // 0x0010(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YItemIDRegister.UpdateFromRegisterBuffer
	 */
	struct UYItemIDRegister_UpdateFromRegisterBuffer_Params
	{	};

	/**
	 * Function DreadGame.YItemIDRegister.UpdateFromItemIDListBuffer
	 */
	struct UYItemIDRegister_UpdateFromItemIDListBuffer_Params
	{	};

	/**
	 * Function DreadGame.YItemIDRegister.SaveToFiles
	 */
	struct UYItemIDRegister_SaveToFiles_Params
	{	};

	/**
	 * Function DreadGame.YItemIDRegister.RepeatCheckoutRegisterFile
	 */
	struct UYItemIDRegister_RepeatCheckoutRegisterFile_Params
	{	};

	/**
	 * DelegateFunction DreadGame.YItemIDRegister.OnCheckedOutReattemptSuceeded__DelegateSignature
	 */
	struct UYItemIDRegister_OnCheckedOutReattemptSuceeded__DelegateSignature_Params
	{	};

	/**
	 * Function DreadGame.YInterface_ItemIDAsset.IsPublicReady
	 */
	struct UYInterface_ItemIDAsset_IsPublicReady_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YInterface_ItemIDAsset.IsInternalOnly
	 */
	struct UYInterface_ItemIDAsset_IsInternalOnly_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YInterface_ItemIDAsset.HasMarket3DPreview
	 */
	struct UYInterface_ItemIDAsset_HasMarket3DPreview_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YInterface_ItemIDAsset.GetToolTipSubline
	 */
	struct UYInterface_ItemIDAsset_GetToolTipSubline_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YInterface_ItemIDAsset.GetToolTipIconPath
	 */
	struct UYInterface_ItemIDAsset_GetToolTipIconPath_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YInterface_ItemIDAsset.GetToolTipHeadline
	 */
	struct UYInterface_ItemIDAsset_GetToolTipHeadline_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YInterface_ItemIDAsset.GetToolTipDescription
	 */
	struct UYInterface_ItemIDAsset_GetToolTipDescription_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YInterface_ItemIDAsset.GetQualityLevel
	 */
	struct UYInterface_ItemIDAsset_GetQualityLevel_Params
	{
	public:
		EYQualityLevel                                             ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YInterface_ItemIDAsset.GetItemUIData
	 */
	struct UYInterface_ItemIDAsset_GetItemUIData_Params
	{
	public:
		struct FYItemUIData                                        ReturnValue;                                             // 0x0000(0x00D0)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YInterface_ItemIDAsset.GetItemTier
	 */
	struct UYInterface_ItemIDAsset_GetItemTier_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YInterface_ItemIDAsset.GetItemMetaData
	 */
	struct UYInterface_ItemIDAsset_GetItemMetaData_Params
	{
	public:
		struct FYItemMetaData                                      ReturnValue;                                             // 0x0000(0x0003)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YInterface_ItemIDAsset.GetItemID
	 */
	struct UYInterface_ItemIDAsset_GetItemID_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YInterface_ItemIDAsset.GetHighResIconPath
	 */
	struct UYInterface_ItemIDAsset_GetHighResIconPath_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YInterface_ItemIDAsset.GetDetailedDescription
	 */
	struct UYInterface_ItemIDAsset_GetDetailedDescription_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YInterface_ItemIDAsset.GetCompatibleShipClasses
	 */
	struct UYInterface_ItemIDAsset_GetCompatibleShipClasses_Params
	{
	public:
		TArray<EYShipClass>                                        ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YInterface_ItemIDAsset.BuildDebugString
	 */
	struct UYInterface_ItemIDAsset_BuildDebugString_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YWeapon.ReceiveReloadingStop
	 */
	struct AYWeapon_ReceiveReloadingStop_Params
	{	};

	/**
	 * Function DreadGame.YWeapon.ReceiveReloadingStart
	 */
	struct AYWeapon_ReceiveReloadingStart_Params
	{	};

	/**
	 * Function DreadGame.YWeapon.ReceiveReady
	 */
	struct AYWeapon_ReceiveReady_Params
	{	};

	/**
	 * Function DreadGame.YWeapon.ReceiveFiring
	 */
	struct AYWeapon_ReceiveFiring_Params
	{
	public:
		struct FYTargetInfo                                        targetInfo;                                              // 0x0000(0x0054)  (Parm, NativeAccessSpecifierPublic)
		int32_t                                                    randomSeed;                                              // 0x0054(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YWeapon.ReceiveCoolingDown
	 */
	struct AYWeapon_ReceiveCoolingDown_Params
	{	};

	/**
	 * Function DreadGame.YWeapon.ReceiveCharging
	 */
	struct AYWeapon_ReceiveCharging_Params
	{	};

	/**
	 * Function DreadGame.YWeapon.OnOwningPawnGetPossessed
	 */
	struct AYWeapon_OnOwningPawnGetPossessed_Params
	{
	public:
		class AYPawn*                                              possessedPawn;                                           // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AController*                                         possessingController;                                    // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YWeapon.IsOnTarget
	 */
	struct AYWeapon_IsOnTarget_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YWeapon.IsFiring
	 */
	struct AYWeapon_IsFiring_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YWeapon.GetTeam
	 */
	struct AYWeapon_GetTeam_Params
	{
	public:
		EYTeam                                                     ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YWeapon.GetShootingTransform
	 */
	struct AYWeapon_GetShootingTransform_Params
	{
	public:
		class FName                                                SocketName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_LEW2[0x8];                                   // 0x0008(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FTransform                                          ReturnValue;                                             // 0x0010(0x0030)  (Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YWeapon.GetOwningPawn
	 */
	struct AYWeapon_GetOwningPawn_Params
	{
	public:
		class AYPawn*                                              ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YWeapon.GetOwningController
	 */
	struct AYWeapon_GetOwningController_Params
	{
	public:
		class AController*                                         ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YWeapon.GetCurrentRandomSeed
	 */
	struct AYWeapon_GetCurrentRandomSeed_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YWeapon.GetAimAtLocation
	 */
	struct AYWeapon_GetAimAtLocation_Params
	{
	public:
		struct FVector                                             ReturnValue;                                             // 0x0000(0x000C)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbility.TriggerVOOnCooldownExpired
	 */
	struct UYAbility_TriggerVOOnCooldownExpired_Params
	{	};

	/**
	 * Function DreadGame.YAbility.TriggerCameraShake
	 */
	struct UYAbility_TriggerCameraShake_Params
	{	};

	/**
	 * Function DreadGame.YAbility.OnResetAbilityVisuals
	 */
	struct UYAbility_OnResetAbilityVisuals_Params
	{	};

	/**
	 * Function DreadGame.YAbility.OnOwnerEnergyWheelFunctionActivated
	 */
	struct UYAbility_OnOwnerEnergyWheelFunctionActivated_Params
	{
	public:
		EYEnergyWheelSelection                                     EnergyWheelSelection;                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbility.OnOwnerDied
	 */
	struct UYAbility_OnOwnerDied_Params
	{	};

	/**
	 * Function DreadGame.YAbility.OnInitialize
	 */
	struct UYAbility_OnInitialize_Params
	{	};

	/**
	 * Function DreadGame.YAbility.OnCoolDownCompleted
	 */
	struct UYAbility_OnCoolDownCompleted_Params
	{
	public:
		class AYPawn*                                              PawnOwner;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbility.OnActorListReceived
	 */
	struct UYAbility_OnActorListReceived_Params
	{
	public:
		TArray<class AActor*>                                      Actors;                                                  // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbility.OnAbilityDeactivated
	 */
	struct UYAbility_OnAbilityDeactivated_Params
	{
	public:
		class AYPawn*                                              PawnOwner;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbility.OnAbilityCanceled
	 */
	struct UYAbility_OnAbilityCanceled_Params
	{
	public:
		class AYPawn*                                              PawnOwner;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbility.OnAbilityActivated
	 */
	struct UYAbility_OnAbilityActivated_Params
	{
	public:
		class AYPawn*                                              PawnOwner;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       abilitySucceeded;                                        // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbility.GetUnmodifiedAbilityCoolDown
	 */
	struct UYAbility_GetUnmodifiedAbilityCoolDown_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbility.GetTimeActive
	 */
	struct UYAbility_GetTimeActive_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbility.GetTargets
	 */
	struct UYAbility_GetTargets_Params
	{
	public:
		TArray<class AActor*>                                      ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbility.GetSupply
	 */
	struct UYAbility_GetSupply_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbility.GetPawnOwner
	 */
	struct UYAbility_GetPawnOwner_Params
	{
	public:
		class AYPawn*                                              ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbility.GetDefaultSupply
	 */
	struct UYAbility_GetDefaultSupply_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbility.GetCurrentCoolDown
	 */
	struct UYAbility_GetCurrentCoolDown_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbility.GetCooldown
	 */
	struct UYAbility_GetCooldown_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbility.GetAbilityNameInternal
	 */
	struct UYAbility_GetAbilityNameInternal_Params
	{
	public:
		class FName                                                ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbility.GetAbilityName
	 */
	struct UYAbility_GetAbilityName_Params
	{
	public:
		class FName                                                ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbility.GetAbilityClassID
	 */
	struct UYAbility_GetAbilityClassID_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbility.GetAbilityCategory
	 */
	struct UYAbility_GetAbilityCategory_Params
	{
	public:
		EYAbilityCategory                                          ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbility.AsyncLoadAssetPtr
	 */
	struct UYAbility_AsyncLoadAssetPtr_Params
	{
	public:
		TAssetPtr<class UObject>                                   Asset;                                                   // 0x0000(0x001C)  (ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YWeaponGroup.TriggerCameraShake
	 */
	struct UYWeaponGroup_TriggerCameraShake_Params
	{
	public:
		class UClass*                                              Shake;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      Delay;                                                   // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YWeaponManagerComponent.SetTeam
	 */
	struct UYWeaponManagerComponent_SetTeam_Params
	{
	public:
		EYTeam                                                     Team;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YWeaponManagerComponent.ServerStopFireAllWeaponGroups
	 */
	struct UYWeaponManagerComponent_ServerStopFireAllWeaponGroups_Params
	{	};

	/**
	 * Function DreadGame.YWeaponManagerComponent.ServerStopFireActiveWeaponGroup
	 */
	struct UYWeaponManagerComponent_ServerStopFireActiveWeaponGroup_Params
	{	};

	/**
	 * Function DreadGame.YWeaponManagerComponent.ServerStartReloadActiveWeaponGroup
	 */
	struct UYWeaponManagerComponent_ServerStartReloadActiveWeaponGroup_Params
	{	};

	/**
	 * Function DreadGame.YWeaponManagerComponent.ServerStartFireActiveWeaponGroup
	 */
	struct UYWeaponManagerComponent_ServerStartFireActiveWeaponGroup_Params
	{
	public:
		struct FYTargetInfo                                        targetInfo;                                              // 0x0000(0x0054)  (Parm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YWeaponManagerComponent.ServerSetTargetInfo
	 */
	struct UYWeaponManagerComponent_ServerSetTargetInfo_Params
	{
	public:
		struct FYTargetInfo                                        targetInfo;                                              // 0x0000(0x0054)  (Parm, NativeAccessSpecifierPublic)
		int32_t                                                    weaponGroup;                                             // 0x0054(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YWeaponManagerComponent.ServerSetActiveTargetInfoUnreliable
	 */
	struct UYWeaponManagerComponent_ServerSetActiveTargetInfoUnreliable_Params
	{
	public:
		struct FYTargetInfo                                        targetInfo;                                              // 0x0000(0x0054)  (Parm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YWeaponManagerComponent.ServerSetActiveTargetInfoReliable
	 */
	struct UYWeaponManagerComponent_ServerSetActiveTargetInfoReliable_Params
	{
	public:
		struct FYTargetInfo                                        targetInfo;                                              // 0x0000(0x0054)  (Parm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YWeaponManagerComponent.ServerActivateWeaponGroup
	 */
	struct UYWeaponManagerComponent_ServerActivateWeaponGroup_Params
	{
	public:
		int32_t                                                    weaponGroup;                                             // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YWeaponManagerComponent.OnSpreadChanged
	 */
	struct UYWeaponManagerComponent_OnSpreadChanged_Params
	{
	public:
		float                                                      newSpread;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    GroupIndex;                                              // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YWeaponManagerComponent.OnRep_WeaponGroupNetData
	 */
	struct UYWeaponManagerComponent_OnRep_WeaponGroupNetData_Params
	{	};

	/**
	 * Function DreadGame.YWeaponManagerComponent.OnRep_WeaponAmmoCounter
	 */
	struct UYWeaponManagerComponent_OnRep_WeaponAmmoCounter_Params
	{	};

	/**
	 * Function DreadGame.YWeaponManagerComponent.OnRep_TargetInfo
	 */
	struct UYWeaponManagerComponent_OnRep_TargetInfo_Params
	{	};

	/**
	 * Function DreadGame.YWeaponManagerComponent.OnRep_CurrentWeaponGroupIdx
	 */
	struct UYWeaponManagerComponent_OnRep_CurrentWeaponGroupIdx_Params
	{	};

	/**
	 * Function DreadGame.YWeaponManagerComponent.OnRep_CurrentReloadingWeaponIndex
	 */
	struct UYWeaponManagerComponent_OnRep_CurrentReloadingWeaponIndex_Params
	{	};

	/**
	 * Function DreadGame.YWeaponManagerComponent.NotifyAimStateServer
	 */
	struct UYWeaponManagerComponent_NotifyAimStateServer_Params
	{
	public:
		bool                                                       moving;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       aiming;                                                  // 0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YWeaponManagerComponent.IsReloading
	 */
	struct UYWeaponManagerComponent_IsReloading_Params
	{
	public:
		int32_t                                                    weaponGroupIdx;                                          // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0004(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YWeaponManagerComponent.GetWeaponName
	 */
	struct UYWeaponManagerComponent_GetWeaponName_Params
	{
	public:
		int32_t                                                    groupIdx;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_M66X[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FString                                              ReturnValue;                                             // 0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YWeaponManagerComponent.GetTeam
	 */
	struct UYWeaponManagerComponent_GetTeam_Params
	{
	public:
		EYTeam                                                     ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YWeaponManagerComponent.GetSpread
	 */
	struct UYWeaponManagerComponent_GetSpread_Params
	{
	public:
		int32_t                                                    groupIdx;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      ReturnValue;                                             // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YWeaponManagerComponent.GetMaxAmmo
	 */
	struct UYWeaponManagerComponent_GetMaxAmmo_Params
	{
	public:
		int32_t                                                    groupIdx;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    ReturnValue;                                             // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YWeaponManagerComponent.GetCurrentSpread
	 */
	struct UYWeaponManagerComponent_GetCurrentSpread_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YWeaponManagerComponent.GetCurrentMaxAmmoAmount
	 */
	struct UYWeaponManagerComponent_GetCurrentMaxAmmoAmount_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YWeaponManagerComponent.GetCurrentAmmoAmount
	 */
	struct UYWeaponManagerComponent_GetCurrentAmmoAmount_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YWeaponManagerComponent.GetAmmo
	 */
	struct UYWeaponManagerComponent_GetAmmo_Params
	{
	public:
		int32_t                                                    groupIdx;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    ReturnValue;                                             // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YWeaponManagerComponent.GetActiveWeaponGroup
	 */
	struct UYWeaponManagerComponent_GetActiveWeaponGroup_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YWeaponManagerComponent.ClientOnStartReloadActiveWeaponGroup
	 */
	struct UYWeaponManagerComponent_ClientOnStartReloadActiveWeaponGroup_Params
	{	};

	/**
	 * Function DreadGame.YProjectile.ShouldDamageOwner
	 */
	struct AYProjectile_ShouldDamageOwner_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YProjectile.SetMaxTravelDistance
	 */
	struct AYProjectile_SetMaxTravelDistance_Params
	{
	public:
		float                                                      maxTravelDistance;                                       // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       skipImmediateDistanceCheck;                              // 0x0004(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YProjectile.OnUpdateVelocity
	 */
	struct AYProjectile_OnUpdateVelocity_Params
	{
	public:
		float                                                      DeltaSeconds;                                            // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YProjectile.OnUpdateCollision
	 */
	struct AYProjectile_OnUpdateCollision_Params
	{
	public:
		struct FVector                                             deltaMovement;                                           // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		float                                                      DeltaSeconds;                                            // 0x000C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YProjectile.OnReachedProximityRange
	 */
	struct AYProjectile_OnReachedProximityRange_Params
	{	};

	/**
	 * Function DreadGame.YProjectile.OnProjectileInitialized
	 */
	struct AYProjectile_OnProjectileInitialized_Params
	{	};

	/**
	 * Function DreadGame.YProjectile.OnMaxDistanceReached
	 */
	struct AYProjectile_OnMaxDistanceReached_Params
	{	};

	/**
	 * Function DreadGame.YProjectile.OnImpact
	 */
	struct AYProjectile_OnImpact_Params
	{
	public:
		struct FHitResult                                          HitResult;                                               // 0x0000(0x0088)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YProjectile.OnForceExplosion
	 */
	struct AYProjectile_OnForceExplosion_Params
	{	};

	/**
	 * Function DreadGame.YProjectile.OnExploding
	 */
	struct AYProjectile_OnExploding_Params
	{	};

	/**
	 * Function DreadGame.YProjectile.OnDealRadialDamageToPawn
	 */
	struct AYProjectile_OnDealRadialDamageToPawn_Params
	{
	public:
		class AYPawn*                                              Pawn;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       isShieldActive;                                          // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_PS00[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      currentExplosionLifeTime;                                // 0x000C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YProjectile.OnCleanUpProjectile
	 */
	struct AYProjectile_OnCleanUpProjectile_Params
	{	};

	/**
	 * Function DreadGame.YProjectile.IsStoppingSimulation
	 */
	struct AYProjectile_IsStoppingSimulation_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YProjectile.GetTeam
	 */
	struct AYProjectile_GetTeam_Params
	{
	public:
		EYTeam                                                     ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YProjectile.GetProjectileOfflineData
	 */
	struct AYProjectile_GetProjectileOfflineData_Params
	{
	public:
		struct FYProjectileOfflineDataTableRow                     ReturnValue;                                             // 0x0000(0x0218)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YProjectile.GetModifiedMaxTravelDistance
	 */
	struct AYProjectile_GetModifiedMaxTravelDistance_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YProjectile.CollideProjectile
	 */
	struct AYProjectile_CollideProjectile_Params
	{
	public:
		struct FHitResult                                          OutHit;                                                  // 0x0000(0x0088)  (Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YProjectile.CleanUpProjectile
	 */
	struct AYProjectile_CleanUpProjectile_Params
	{	};

	/**
	 * Function DreadGame.YProjectile.CanBeTargeted
	 */
	struct AYProjectile_CanBeTargeted_Params
	{
	public:
		bool                                                       canTargetDuringInstigatorIgnoreTime;                     // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YProjectile.CalculateDamageForDistance
	 */
	struct AYProjectile_CalculateDamageForDistance_Params
	{
	public:
		float                                                      traveledDistance;                                        // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      ReturnValue;                                             // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YProjectile.ApplyDamage
	 */
	struct AYProjectile_ApplyDamage_Params
	{
	public:
		class AActor*                                              Target;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbilityBatteringRam.GetSensorLocation
	 */
	struct UYAbilityBatteringRam_GetSensorLocation_Params
	{
	public:
		struct FVector                                             ReturnValue;                                             // 0x0000(0x000C)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbilityBeamModifier.CollectOwnedBeamWeapons
	 */
	struct UYAbilityBeamModifier_CollectOwnedBeamWeapons_Params
	{	};

	/**
	 * Function DreadGame.YAbilityMovement.OnSoftCollisionOverlap
	 */
	struct UYAbilityMovement_OnSoftCollisionOverlap_Params
	{
	public:
		TArray<struct FYSoftCollisionOverlapResult>                overlapResults;                                          // 0x0000(0x0010)  (Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbilityMovement.IsTurningLeft
	 */
	struct UYAbilityMovement_IsTurningLeft_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbilityPulse.OnDealDamageToPawn
	 */
	struct UYAbilityPulse_OnDealDamageToPawn_Params
	{
	public:
		class AYPawn*                                              Pawn;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbilityWarpJump.TriggerWarpJumpTeleport
	 */
	struct UYAbilityWarpJump_TriggerWarpJumpTeleport_Params
	{	};

	/**
	 * Function DreadGame.YAbilityWarpJump.TriggerWarpJumpEnd
	 */
	struct UYAbilityWarpJump_TriggerWarpJumpEnd_Params
	{	};

	/**
	 * Function DreadGame.YAbilityWarpJump.IsWarmingUp
	 */
	struct UYAbilityWarpJump_IsWarmingUp_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbilityWarpJump.GetTargetLocation
	 */
	struct UYAbilityWarpJump_GetTargetLocation_Params
	{
	public:
		struct FVector                                             ReturnValue;                                             // 0x0000(0x000C)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbilityWarpJump.GetCountdown
	 */
	struct UYAbilityWarpJump_GetCountdown_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbilityBroadSide.GetLastFiredWeapons
	 */
	struct UYAbilityBroadSide_GetLastFiredWeapons_Params
	{
	public:
		TArray<class AYWeapon*>                                    ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbilityFighterDrone.OnOwnerEnergyWheelFunctionActivated
	 */
	struct UYAbilityFighterDrone_OnOwnerEnergyWheelFunctionActivated_Params
	{
	public:
		EYEnergyWheelSelection                                     EnergyWheelSelection;                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbilityFighterDrone.OnOwnerDied
	 */
	struct UYAbilityFighterDrone_OnOwnerDied_Params
	{	};

	/**
	 * Function DreadGame.YAbilityPerimeterDefense.TargetDamaged
	 */
	struct UYAbilityPerimeterDefense_TargetDamaged_Params
	{
	public:
		class AActor*                                              DamagedActor;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      BaseDamage;                                              // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_CGWG[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AController*                                         eventInstigator;                                         // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AYWeapon*                                            causingWeapon;                                           // 0x0018(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UClass*                                              DamageTypeClass;                                         // 0x0020(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbilityRocketSwarm.GetModifiedMaxDistance
	 */
	struct UYAbilityRocketSwarm_GetModifiedMaxDistance_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbilityRocketSwarm.GetLastFiredWeapon
	 */
	struct UYAbilityRocketSwarm_GetLastFiredWeapon_Params
	{
	public:
		class AYWeapon*                                            ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbilityManager.SetTargetActorsInRange
	 */
	struct UYAbilityManager_SetTargetActorsInRange_Params
	{
	public:
		TArray<struct FAbilityPerimeterTargetInfo>                 perimeterTargets;                                        // 0x0000(0x0010)  (ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
		int32_t                                                    abilityIdx;                                              // 0x0010(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbilityManager.ServerReleaseAbility
	 */
	struct UYAbilityManager_ServerReleaseAbility_Params
	{
	public:
		int32_t                                                    AbilityId;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbilityManager.ServerPressAbility
	 */
	struct UYAbilityManager_ServerPressAbility_Params
	{
	public:
		int32_t                                                    AbilityId;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_956T[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AYPawn*                                              lockedPawn;                                              // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbilityManager.SendActorList
	 */
	struct UYAbilityManager_SendActorList_Params
	{
	public:
		TArray<class AActor*>                                      Actors;                                                  // 0x0000(0x0010)  (ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
		class FName                                                abilityName;                                             // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbilityManager.Reset
	 */
	struct UYAbilityManager_Reset_Params
	{	};

	/**
	 * Function DreadGame.YAbilityManager.OnRep_WeaponGroupFireInfos
	 */
	struct UYAbilityManager_OnRep_WeaponGroupFireInfos_Params
	{	};

	/**
	 * Function DreadGame.YAbilityManager.OnRep_GlobalCooldown
	 */
	struct UYAbilityManager_OnRep_GlobalCooldown_Params
	{	};

	/**
	 * Function DreadGame.YAbilityManager.OnRep_CurrentAbilities
	 */
	struct UYAbilityManager_OnRep_CurrentAbilities_Params
	{	};

	/**
	 * Function DreadGame.YAbilityManager.OnRep_Abilities
	 */
	struct UYAbilityManager_OnRep_Abilities_Params
	{	};

	/**
	 * Function DreadGame.YAbilityManager.OnIndividualAbilityCooldownDone
	 */
	struct UYAbilityManager_OnIndividualAbilityCooldownDone_Params
	{
	public:
		class UYAbility*                                           ability;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbilityManager.OnAbilityStartedCooldown
	 */
	struct UYAbilityManager_OnAbilityStartedCooldown_Params
	{
	public:
		class UYAbility*                                           ability;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbilityManager.MulticastAbilityCanceled
	 */
	struct UYAbilityManager_MulticastAbilityCanceled_Params
	{
	public:
		class FName                                                abilityName;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbilityManager.GetGlobalDefaultCooldown
	 */
	struct UYAbilityManager_GetGlobalDefaultCooldown_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbilityManager.GetGlobalCurrentCooldown
	 */
	struct UYAbilityManager_GetGlobalCurrentCooldown_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbilityManager.GetAbilityItems
	 */
	struct UYAbilityManager_GetAbilityItems_Params
	{
	public:
		TArray<class UYAbility*>                                   ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbilityManager.ClientTriggerPulseVisualAndSoundActorList
	 */
	struct UYAbilityManager_ClientTriggerPulseVisualAndSoundActorList_Params
	{
	public:
		TArray<class AActor*>                                      Actors;                                                  // 0x0000(0x0010)  (ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
		class FName                                                abilityName;                                             // 0x0010(0x0008)  (ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbilityManager.ClientNotifyDeactivation
	 */
	struct UYAbilityManager_ClientNotifyDeactivation_Params
	{
	public:
		class FName                                                abilityName;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       wasInterrupted;                                          // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       triggerVO;                                               // 0x0009(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbilityManager.ClientNotifyActivation
	 */
	struct UYAbilityManager_ClientNotifyActivation_Params
	{
	public:
		bool                                                       abilitySucceeded;                                        // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_EVPU[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FName                                                abilityName;                                             // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YAbilityManager.ClientCooldownCompleted
	 */
	struct UYAbilityManager_ClientCooldownCompleted_Params
	{
	public:
		class FName                                                abilityName;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YActorPoolManager.GetPooledActor
	 */
	struct UYActorPoolManager_GetPooledActor_Params
	{
	public:
		class UObject*                                             WorldContext;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UClass*                                              objectClass;                                             // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              ReturnValue;                                             // 0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YCreepNavigation.IsBlockedByPawn
	 */
	struct AYCreepNavigation_IsBlockedByPawn_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YScoringDataManager.Initialize
	 */
	struct UYScoringDataManager_Initialize_Params
	{	};

	/**
	 * Function DreadGame.YGameMode.OnPlayerKilled
	 */
	struct AYGameMode_OnPlayerKilled_Params
	{
	public:
		class AYPawn*                                              Killer;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AYPawn*                                              victim;                                                  // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DreadGame.YInterface_PlayerScore.WasHealedWithinTimeFrame
	 */
	struct UYInterface_PlayerScore_WasHealedWithinTimeFrame_Params
	{
	public:
