#pragma once

/**
 * Name: Dreadnought
 * Version: Latest
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * Class Engine.BlueprintAsyncActionBase
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UBlueprintAsyncActionBase : public UObject
	{
	public:
		void Activate();
		static UClass* StaticClass();
	};

	/**
	 * Class Engine.ActorComponent
	 * Size -> 0x00D0 (FullSize[0x00F8] - InheritedSize[0x0028])
	 */
	class UActorComponent : public UObject
	{
	public:
		unsigned char                                              UnknownData_KNOS[0x8];                                   // 0x0028(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FActorComponentTickFunction                         PrimaryComponentTick;                                    // 0x0030(0x0050) Edit, DisableEditOnInstance, NativeAccessSpecifierPublic
		TArray<class FName>                                        ComponentTags;                                           // 0x0080(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<class UAssetUserData*>                              AssetUserData;                                           // 0x0090(0x0010) ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected
		bool                                                       UnknownData_ZP7R : 3;                                    // 0x00A0(0x0001) BIT_FIELD (PADDING)
		bool                                                       bReplicates : 1;                                         // 0x00A0(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected
		bool                                                       bNetAddressable : 1;                                     // 0x00A0(0x0001) BIT_FIELD NoDestructor, Protected, NativeAccessSpecifierProtected
		bool                                                       UnknownData_DPA7 : 3;                                    // 0x00A0(0x0001) BIT_FIELD (PADDING)
		bool                                                       UnknownData_775C : 7;                                    // 0x00A1(0x0001) BIT_FIELD (PADDING)
		bool                                                       bCreatedByConstructionScript : 1;                        // 0x00A1(0x0001) BIT_FIELD Deprecated, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bInstanceComponent : 1;                                  // 0x00A2(0x0001) BIT_FIELD Deprecated, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bAutoActivate : 1;                                       // 0x00A2(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bIsActive : 1;                                           // 0x00A2(0x0001) BIT_FIELD Net, Transient, RepNotify, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bEditableWhenInherited : 1;                              // 0x00A2(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       UnknownData_7LRM : 1;                                    // 0x00A2(0x0001) BIT_FIELD (PADDING)
		bool                                                       bCanEverAffectNavigation : 1;                            // 0x00A2(0x0001) BIT_FIELD Edit, NoDestructor, AdvancedDisplay, Protected, NativeAccessSpecifierProtected
		bool                                                       UnknownData_ISJQ : 1;                                    // 0x00A2(0x0001) BIT_FIELD (PADDING)
		bool                                                       bWantsBeginPlay : 1;                                     // 0x00A2(0x0001) BIT_FIELD NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ADRS[0x1];                                   // 0x00A3(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		EComponentCreationMethod                                   CreationMethod;                                          // 0x00A4(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RRGS[0xB];                                   // 0x00A5(0x000B) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FSimpleMemberReference>                      UCSModifiedProperties;                                   // 0x00B0(0x0010) ZeroConstructor, NativeAccessSpecifierPrivate
		class FScriptMulticastDelegate                             OnComponentActivated;                                    // 0x00C0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnComponentDeactivated;                                  // 0x00D0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_L8OP[0x8];                                   // 0x00E0(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    m_skipOwnerActorReplications;                            // 0x00E8(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_KJNU[0xC];                                   // 0x00EC(0x000C) MISSED OFFSET (PADDING)

	public:
		void ToggleActive();
		void SetTickGroup(ETickingGroup NewTickGroup);
		void SetTickableWhenPaused(bool bTickableWhenPaused);
		void SetIsReplicated(bool ShouldReplicate);
		void SetComponentTickInterval(float TickInterval);
		void SetComponentTickEnabled(bool bEnabled);
		void SetActive(bool bNewActive, bool bReset);
		void RemoveTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
		void RemoveTickPrerequisiteActor(class AActor* PrerequisiteActor);
		void ReceiveTick(float DeltaSeconds);
		void ReceiveEndPlay(EEndPlayReason EndPlayReason);
		void ReceiveBeginPlay();
		void OnRep_IsActive();
		void K2_DestroyComponent(class UObject* Object);
		bool IsComponentTickEnabled();
		bool IsBeingDestroyed();
		bool IsActive();
		class AActor* GetOwner();
		float GetComponentTickInterval();
		void Deactivate();
		bool ComponentHasTag(const class FName& Tag);
		void AddTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
		void AddTickPrerequisiteActor(class AActor* PrerequisiteActor);
		void Activate(bool bReset);
		static UClass* StaticClass();
	};

	/**
	 * Class Engine.SceneComponent
	 * Size -> 0x01B8 (FullSize[0x02B0] - InheritedSize[0x00F8])
	 */
	class USceneComponent : public UActorComponent
	{
	public:
		unsigned char                                              UnknownData_JZVP[0x8];                                   // 0x00F8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class USceneComponent*                                     AttachParent;                                            // 0x0100(0x0008) ExportObject, Net, ZeroConstructor, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		TArray<class USceneComponent*>                             AttachChildren;                                          // 0x0108(0x0010) ExportObject, Net, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate
		class FName                                                AttachSocketName;                                        // 0x0118(0x0008) Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       UnknownData_BT16 : 1;                                    // 0x0120(0x0001) BIT_FIELD (PADDING)
		bool                                                       bWorldToComponentUpdated : 1;                            // 0x0120(0x0001) BIT_FIELD Transient, NoDestructor, Protected, NativeAccessSpecifierProtected
		bool                                                       bAbsoluteLocation : 1;                                   // 0x0120(0x0001) BIT_FIELD Edit, BlueprintVisible, Net, RepNotify, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		bool                                                       bAbsoluteRotation : 1;                                   // 0x0120(0x0001) BIT_FIELD Edit, BlueprintVisible, Net, RepNotify, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		bool                                                       bAbsoluteScale : 1;                                      // 0x0120(0x0001) BIT_FIELD Edit, BlueprintVisible, Net, RepNotify, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		bool                                                       bVisible : 1;                                            // 0x0120(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bHiddenInGame : 1;                                       // 0x0120(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bShouldUpdatePhysicsVolume : 1;                          // 0x0120(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		bool                                                       bBoundsChangeTriggersStreamingDataRebuild : 1;           // 0x0121(0x0001) BIT_FIELD NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bUseAttachParentBound : 1;                               // 0x0121(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		bool                                                       UnknownData_YXDW : 2;                                    // 0x0121(0x0001) BIT_FIELD (PADDING)
		bool                                                       bAbsoluteTranslation : 1;                                // 0x0121(0x0001) BIT_FIELD Deprecated, NoDestructor, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_WMTW[0x2];                                   // 0x0122(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TWeakObjectPtr<class APhysicsVolume>                       PhysicsVolume;                                           // 0x0124(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_LHVA[0x74];                                  // 0x012C(0x0074) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             RelativeLocation;                                        // 0x01A0(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, NativeAccessSpecifierPublic
		struct FRotator                                            RelativeRotation;                                        // 0x01AC(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_LR0F[0x28];                                  // 0x01B8(0x0028) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             RelativeScale3D;                                         // 0x01E0(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, Interp, NoDestructor, NativeAccessSpecifierPublic
		struct FVector                                             RelativeTranslation;                                     // 0x01EC(0x000C) ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		EComponentMobility                                         Mobility;                                                // 0x01F8(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EDetailMode                                                DetailMode;                                              // 0x01F9(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bSkipClientUpdateComponentToWorld;                       // 0x01FA(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, NativeAccessSpecifierProtected
		bool                                                       bSkipServerUpdateComponentToWorld;                       // 0x01FB(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_1UZ8[0x14];                                  // 0x01FC(0x0014) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             ComponentVelocity;                                       // 0x0210(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_SDTS[0x4];                                   // 0x021C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FScriptMulticastDelegate                             PhysicsVolumeChangedDelegate;                            // 0x0220(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8ULW[0x80];                                  // 0x0230(0x0080) MISSED OFFSET (PADDING)

	public:
		void ToggleVisibility(bool bPropagateToChildren);
		bool SnapTo(class USceneComponent* InParent, const class FName& InSocketName);
		void SetWorldScale3D(const struct FVector& NewScale);
		void SetVisibility(bool bNewVisibility, bool bPropagateToChildren);
		void SetRelativeScale3D(const struct FVector& NewScale3D);
		void SetHiddenInGame(bool NewHidden, bool bPropagateToChildren);
		void SetAbsolute(bool bNewAbsoluteLocation, bool bNewAbsoluteRotation, bool bNewAbsoluteScale);
		void ResetRelativeTransform();
		void OnRep_Visibility(bool OldValue);
		void OnRep_Transform();
		void OnRep_AttachSocketName();
		void OnRep_AttachParent();
		void K2_SetWorldTransform(const struct FTransform& NewTransform, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
		void K2_SetWorldRotation(const struct FRotator& NewRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
		void K2_SetWorldLocationAndRotation(const struct FVector& NewLocation, const struct FRotator& NewRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
		void K2_SetWorldLocation(const struct FVector& NewLocation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
		void K2_SetRelativeTransform(const struct FTransform& NewTransform, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
		void K2_SetRelativeRotation(const struct FRotator& NewRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
		void K2_SetRelativeLocationAndRotation(const struct FVector& NewLocation, const struct FRotator& NewRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
		void K2_SetRelativeLocation(const struct FVector& NewLocation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
		struct FTransform K2_GetComponentToWorld();
		struct FVector K2_GetComponentScale();
		struct FRotator K2_GetComponentRotation();
		struct FVector K2_GetComponentLocation();
		void K2_DetachFromComponent(EDetachmentRule LocationRule, EDetachmentRule RotationRule, EDetachmentRule ScaleRule, bool bCallModify);
		bool K2_AttachToComponent(class USceneComponent* Parent, const class FName& SocketName, EAttachmentRule LocationRule, EAttachmentRule RotationRule, EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);
		bool K2_AttachTo(class USceneComponent* InParent, const class FName& InSocketName, EAttachLocation AttachType, bool bWeldSimulatedBodies);
		void K2_AddWorldTransform(const struct FTransform& DeltaTransform, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
		void K2_AddWorldRotation(const struct FRotator& DeltaRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
		void K2_AddWorldOffset(const struct FVector& DeltaLocation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
		void K2_AddRelativeRotation(const struct FRotator& DeltaRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
		void K2_AddRelativeLocation(const struct FVector& DeltaLocation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
		void K2_AddLocalTransform(const struct FTransform& DeltaTransform, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
		void K2_AddLocalRotation(const struct FRotator& DeltaRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
		void K2_AddLocalOffset(const struct FVector& DeltaLocation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
		bool IsVisible();
		bool IsSimulatingPhysics(const class FName& BoneName);
		bool IsAnySimulatingPhysics();
		struct FVector GetUpVector();
		struct FTransform GetSocketTransform(const class FName& InSocketName, ERelativeTransformSpace TransformSpace);
		struct FRotator GetSocketRotation(const class FName& InSocketName);
		struct FQuat GetSocketQuaternion(const class FName& InSocketName);
		struct FVector GetSocketLocation(const class FName& InSocketName);
		struct FVector GetRightVector();
		struct FTransform GetRelativeTransform();
		class APhysicsVolume* GetPhysicsVolume();
		void GetParentComponents(TArray<class USceneComponent*>* Parents);
		int32_t GetNumChildrenComponents();
		struct FVector GetForwardVector();
		struct FVector GetComponentVelocity();
		void GetChildrenComponents(bool bIncludeAllDescendants, TArray<class USceneComponent*>* Children);
		class USceneComponent* GetChildComponent(int32_t ChildIndex);
		class FName GetAttachSocketName();
		class USceneComponent* GetAttachParent();
		TArray<class FName> GetAllSocketNames();
		bool DoesSocketExist(const class FName& InSocketName);
		void DetachFromParent(bool bMaintainWorldPosition, bool bCallModify);
		static UClass* StaticClass();
	};

	/**
	 * Class Engine.PrimitiveComponent
	 * Size -> 0x03A0 (FullSize[0x0650] - InheritedSize[0x02B0])
	 */
	class UPrimitiveComponent : public USceneComponent
	{
	public:
		unsigned char                                              UnknownData_92V0[0x8];                                   // 0x02B0(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MinDrawDistance;                                         // 0x02B8(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      LDMaxDrawDistance;                                       // 0x02BC(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      CachedMaxDrawDistance;                                   // 0x02C0(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ESceneDepthPriorityGroup                                   DepthPriorityGroup;                                      // 0x02C4(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ESceneDepthPriorityGroup                                   ViewOwnerDepthPriorityGroup;                             // 0x02C5(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_U9OO[0x2];                                   // 0x02C6(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       bAlwaysCreatePhysicsState : 1;                           // 0x02C8(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		bool                                                       bGenerateOverlapEvents : 1;                              // 0x02C8(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       m_neverPropogateOverlapUpdates : 1;                      // 0x02C8(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bMultiBodyOverlap : 1;                                   // 0x02C8(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		bool                                                       bCheckAsyncSceneOnMove : 1;                              // 0x02C8(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		bool                                                       bTraceComplexOnMove : 1;                                 // 0x02C8(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		bool                                                       bReturnMaterialOnMove : 1;                               // 0x02C8(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		bool                                                       bUseViewOwnerDepthPriorityGroup : 1;                     // 0x02C8(0x0001) BIT_FIELD NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bAllowCullDistanceVolume : 1;                            // 0x02C9(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		bool                                                       bHasMotionBlurVelocityMeshes : 1;                        // 0x02C9(0x0001) BIT_FIELD NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bRenderInMainPass : 1;                                   // 0x02C9(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		bool                                                       bReceivesDecals : 1;                                     // 0x02C9(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		bool                                                       bOwnerNoSee : 1;                                         // 0x02C9(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		bool                                                       bOnlyOwnerSee : 1;                                       // 0x02C9(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		bool                                                       bTreatAsBackgroundForOcclusion : 1;                      // 0x02C9(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		bool                                                       bUseAsOccluder : 1;                                      // 0x02C9(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		bool                                                       bSelectable : 1;                                         // 0x02CA(0x0001) BIT_FIELD NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bForceMipStreaming : 1;                                  // 0x02CA(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		bool                                                       bHasPerInstanceHitProxies : 1;                           // 0x02CA(0x0001) BIT_FIELD NoDestructor, NativeAccessSpecifierPublic
		bool                                                       CastShadow : 1;                                          // 0x02CA(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bAffectDynamicIndirectLighting : 1;                      // 0x02CA(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		bool                                                       bAffectDistanceFieldLighting : 1;                        // 0x02CA(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		bool                                                       bCastDynamicShadow : 1;                                  // 0x02CA(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		bool                                                       bCastStaticShadow : 1;                                   // 0x02CA(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		bool                                                       bCastVolumetricTranslucentShadow : 1;                    // 0x02CB(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		bool                                                       bSelfShadowOnly : 1;                                     // 0x02CB(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		bool                                                       bCastFarShadow : 1;                                      // 0x02CB(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		bool                                                       bCastInsetShadow : 1;                                    // 0x02CB(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		bool                                                       bCastCinematicShadow : 1;                                // 0x02CB(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		bool                                                       bCastHiddenShadow : 1;                                   // 0x02CB(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		bool                                                       bCastShadowAsTwoSided : 1;                               // 0x02CB(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		bool                                                       bLightAsIfStatic : 1;                                    // 0x02CB(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		bool                                                       bLightAttachmentsAsGroup : 1;                            // 0x02CC(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1TIU[0x3];                                   // 0x02CD(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		EIndirectLightingCacheQuality                              IndirectLightingCacheQuality;                            // 0x02D0(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_AHPF[0x3];                                   // 0x02D1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       bReceiveCombinedCSMAndStaticShadowsFromStationaryLights : 1; // 0x02D4(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		bool                                                       bSingleSampleShadowFromStationaryLights : 1;             // 0x02D4(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_6HA1[0x3];                                   // 0x02D5(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FLightingChannels                                   LightingChannels;                                        // 0x02D8(0x0003) Edit, BlueprintVisible, BlueprintReadOnly, AdvancedDisplay, NativeAccessSpecifierPublic
		bool                                                       bHasCachedStaticLighting;                                // 0x02DB(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bStaticLightingBuildEnqueued;                            // 0x02DC(0x0001) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_XAKY[0x3];                                   // 0x02DD(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       bIgnoreRadialImpulse : 1;                                // 0x02E0(0x0001) BIT_FIELD NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bIgnoreRadialForce : 1;                                  // 0x02E0(0x0001) BIT_FIELD NoDestructor, NativeAccessSpecifierPublic
		bool                                                       AlwaysLoadOnClient : 1;                                  // 0x02E0(0x0001) BIT_FIELD NoDestructor, NativeAccessSpecifierPublic
		bool                                                       AlwaysLoadOnServer : 1;                                  // 0x02E0(0x0001) BIT_FIELD NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bUseEditorCompositing : 1;                               // 0x02E0(0x0001) BIT_FIELD NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bRenderCustomDepth : 1;                                  // 0x02E0(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_TYFT[0x3];                                   // 0x02E1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    CustomDepthStencilValue;                                 // 0x02E4(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    TranslucencySortPriority;                                // 0x02E8(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    VisibilityId;                                            // 0x02EC(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8H4Y[0x4];                                   // 0x02F0(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      LpvBiasMultiplier;                                       // 0x02F4(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_O1R9[0x8];                                   // 0x02F8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FBodyInstance                                       BodyInstance;                                            // 0x0300(0x01B0) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_LTP6[0x8];                                   // 0x04B0(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		EHasCustomNavigableGeometry                                bHasCustomNavigableGeometry;                             // 0x04B8(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_IRR5[0x7];                                   // 0x04B9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      BoundsScale;                                             // 0x04C0(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      LastSubmitTime;                                          // 0x04C4(0x0004) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      LastRenderTime;                                          // 0x04C8(0x0004) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      LastRenderTimeOnScreen;                                  // 0x04CC(0x0004) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECanBeCharacterBase                                        CanBeCharacterBase;                                      // 0x04D0(0x0001) ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_G89S[0x1];                                   // 0x04D1(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		ECanBeCharacterBase                                        CanCharacterStepUpOn;                                    // 0x04D2(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_XAK4[0x5];                                   // 0x04D3(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class AActor*>                                      MoveIgnoreActors;                                        // 0x04D8(0x0010) ZeroConstructor, Transient, DuplicateTransient, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_7UIY[0x10];                                  // 0x04E8(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FScriptMulticastDelegate                             OnComponentHit;                                          // 0x04F8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnComponentBeginOverlap;                                 // 0x0508(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnComponentEndOverlap;                                   // 0x0518(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnComponentWake;                                         // 0x0528(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnComponentSleep;                                        // 0x0538(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnBeginCursorOver;                                       // 0x0548(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnEndCursorOver;                                         // 0x0558(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnClicked;                                               // 0x0568(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnReleased;                                              // 0x0578(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnInputTouchBegin;                                       // 0x0588(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnInputTouchEnd;                                         // 0x0598(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnInputTouchEnter;                                       // 0x05A8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnInputTouchLeave;                                       // 0x05B8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_LTLN[0x14];                                  // 0x05C8(0x0014) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TLazyObjectPtr<class UPrimitiveComponent>                  ReplacementPrimitive;                                    // 0x05DC(0x001C) ExportObject, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UPrimitiveComponent*                                 LODParentPrimitive;                                      // 0x05F8(0x0008) ExportObject, ZeroConstructor, InstancedReference, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		struct FPrimitiveComponentPostPhysicsTickFunction          PostPhysicsComponentTick;                                // 0x0600(0x0050) NativeAccessSpecifierPublic

	public:
		void WakeRigidBody(const class FName& BoneName);
		void WakeAllRigidBodies();
		void SetWalkableSlopeOverride(const struct FWalkableSlopeOverride& NewOverride);
		void SetTranslucentSortPriority(int32_t NewTranslucentSortPriority);
		void SetSimulatePhysics(bool bSimulate);
		void SetRenderInMainPass(bool bValue);
		void SetRenderCustomDepth(bool bValue);
		void SetPhysMaterialOverride(class UPhysicalMaterial* NewPhysMaterial);
		void SetPhysicsMaxAngularVelocity(float NewMaxAngVel, bool bAddToCurrent, const class FName& BoneName);
		void SetPhysicsLinearVelocity(const struct FVector& NewVel, bool bAddToCurrent, const class FName& BoneName);
		void SetPhysicsAngularVelocity(const struct FVector& NewAngVel, bool bAddToCurrent, const class FName& BoneName);
		void SetOwnerNoSee(bool bNewOwnerNoSee);
		void SetOnlyOwnerSee(bool bNewOnlyOwnerSee);
		void SetNotifyRigidBodyCollision(bool bNewNotifyRigidBodyCollision);
		void SetMaterial(int32_t ElementIndex, class UMaterialInterface* Material);
		void SetMassScale(const class FName& BoneName, float InMassScale);
		void SetMassOverrideInKg(const class FName& BoneName, float MassInKg, bool bOverrideMass);
		void SetLockedAxis(EDOFMode LockedAxis);
		void SetLinearDamping(float InDamping);
		void SetEnableGravity(bool bGravityEnabled);
		void SetCustomDepthStencilValue(int32_t Value);
		void SetCullDistance(float NewCullDistance);
		void SetConstraintMode(EDOFMode ConstraintMode);
		void SetCollisionResponseToChannel(ECollisionChannel Channel, ECollisionResponse NewResponse);
		void SetCollisionResponseToAllChannels(ECollisionResponse NewResponse);
		void SetCollisionProfileName(const class FName& InCollisionProfileName);
		void SetCollisionObjectType(ECollisionChannel Channel);
		void SetCollisionEnabled(ECollisionEnabled NewType);
		void SetCenterOfMass(const struct FVector& CenterOfMassOffset, const class FName& BoneName);
		void SetCastShadow(bool NewCastShadow);
		void SetBoundsScale(float NewBoundsScale);
		void SetAngularDamping(float InDamping);
		void SetAllPhysicsLinearVelocity(const struct FVector& NewVel, bool bAddToCurrent);
		void SetAllMassScale(float InMassScale);
		struct FVector ScaleByMomentOfInertia(const struct FVector& InputVector, const class FName& BoneName);
		void PutRigidBodyToSleep(const class FName& BoneName);
		bool K2_LineTraceComponent(const struct FVector& TraceStart, const struct FVector& TraceEnd, bool bTraceComplex, bool bShowTrace, struct FVector* HitLocation, struct FVector* HitNormal, class FName* BoneName);
		bool K2_IsQueryCollisionEnabled();
		bool K2_IsPhysicsCollisionEnabled();
		bool K2_IsCollisionEnabled();
		bool IsOverlappingComponent(class UPrimitiveComponent* OtherComp);
		bool IsOverlappingActor(class AActor* Other);
		bool IsGravityEnabled();
		void IgnoreActorWhenMoving(class AActor* Actor, bool bShouldIgnore);
		struct FWalkableSlopeOverride GetWalkableSlopeOverride();
		struct FVector GetPhysicsLinearVelocityAtPoint(const struct FVector& Point, const class FName& BoneName);
		struct FVector GetPhysicsLinearVelocity(const class FName& BoneName);
		struct FVector GetPhysicsAngularVelocity(const class FName& BoneName);
		void GetOverlappingComponents(TArray<class UPrimitiveComponent*>* InOverlappingComponents);
		void GetOverlappingActors(TArray<class AActor*>* OverlappingActors, class UClass* ClassFilter);
		TArray<struct FOverlapInfo> GetOverlapInfos();
		int32_t GetNumMaterials();
		class UMaterialInterface* GetMaterial(int32_t ElementIndex);
		float GetMassScale(const class FName& BoneName);
		float GetMass();
		float GetLinearDamping();
		struct FVector GetInertiaTensor(const class FName& BoneName);
		ECollisionResponse GetCollisionResponseToChannel(ECollisionChannel Channel);
		class FName GetCollisionProfileName();
		ECollisionChannel GetCollisionObjectType();
		ECollisionEnabled GetCollisionEnabled();
		float GetClosestPointOnCollision(const struct FVector& Point, struct FVector* OutPointOnBody, const class FName& BoneName);
		struct FVector GetCenterOfMass(const class FName& BoneName);
		float GetAngularDamping();
		class UMaterialInstanceDynamic* CreateDynamicMaterialInstance(int32_t ElementIndex, class UMaterialInterface* SourceMaterial);
		class UMaterialInstanceDynamic* CreateAndSetMaterialInstanceDynamicFromMaterial(int32_t ElementIndex, class UMaterialInterface* Parent);
		class UMaterialInstanceDynamic* CreateAndSetMaterialInstanceDynamic(int32_t ElementIndex);
		TArray<class AActor*> CopyArrayOfMoveIgnoreActors();
		void ClearMoveIgnoreActors();
		bool CanCharacterStepUp(class APawn* Pawn);
		void AddTorque(const struct FVector& Torque, const class FName& BoneName, bool bAccelChange);
		void AddRadialImpulse(const struct FVector& Origin, float Radius, float Strength, ERadialImpulseFalloff Falloff, bool bVelChange);
		void AddRadialForce(const struct FVector& Origin, float Radius, float Strength, ERadialImpulseFalloff Falloff, bool bAccelChange);
		void AddLocalForceAtPosition(const struct FVector& Force, const struct FVector& Position, const class FName& BoneName);
		void AddLocalForceAtLocalPosition(const struct FVector& Force, const struct FVector& Position, const class FName& BoneName);
		void AddImpulseAtLocation(const struct FVector& Impulse, const struct FVector& Location, const class FName& BoneName);
		void AddImpulse(const struct FVector& Impulse, const class FName& BoneName, bool bVelChange);
		void AddForceAtLocation(const struct FVector& Force, const struct FVector& Location, const class FName& BoneName);
		void AddForceAtLocalPosition(const struct FVector& Force, const struct FVector& Position, const class FName& BoneName);
		void AddForce(const struct FVector& Force, const class FName& BoneName, bool bAccelChange);
		void AddAngularImpulse(const struct FVector& Impulse, const class FName& BoneName, bool bVelChange);
		static UClass* StaticClass();
	};

	/**
	 * Class Engine.DataTable
	 * Size -> 0x0060 (FullSize[0x0088] - InheritedSize[0x0028])
	 */
	class UDataTable : public UObject
	{
	public:
		class UScriptStruct*                                       RowStruct;                                               // 0x0028(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       m_autogeneratedIDs;                                      // 0x0030(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_QUYN[0x57];                                  // 0x0031(0x0057) MISSED OFFSET (PADDING)

	public:
		std::vector<FName> GetRowNames() const;
		/*
		template<class T>
		inline T* FindRow(const CG::FName& rowName) const
		{
			for (int32_t i = 0; i < RowMap.Data.Count(); ++i)
			{
				CG::TPair<CG::FName, unsigned char*> curRowPair = RowMap.Data[i].Value;
				CG::FName& curRowName = curRowPair.First;
				if (curRowName.ComparisonIndex == rowName.ComparisonIndex && curRowName.Number == rowName.Number)
				{
					#ifdef FNAME_POOL_WITH_CASE_PRESERVING_NAME
					if (curRowName.DisplayIndex == rowName.DisplayIndex)
					#endif
						return reinterpret_cast<T*>(curRowPair.Second);
				}
			}
			
			return nullptr;
		}
		*/
		static UClass* StaticClass();
	};

	/**
	 * Class Engine.Actor
	 * Size -> 0x0398 (FullSize[0x03C0] - InheritedSize[0x0028])
	 */
	class AActor : public UObject
	{
	public:
		struct FActorTickFunction                                  PrimaryActorTick;                                        // 0x0028(0x0050) Edit, DisableEditOnInstance, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_D0CC[0x10];                                  // 0x0078(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CustomTimeDilation;                                      // 0x0088(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bHidden : 1;                                             // 0x008C(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, Net, Interp, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bNetTemporary : 1;                                       // 0x008C(0x0001) BIT_FIELD NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bNetStartup : 1;                                         // 0x008C(0x0001) BIT_FIELD NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bOnlyRelevantToOwner : 1;                                // 0x008C(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bAlwaysRelevant : 1;                                     // 0x008C(0x0001) BIT_FIELD Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bReplicateMovement : 1;                                  // 0x008C(0x0001) BIT_FIELD Edit, Net, DisableEditOnInstance, RepNotify, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bTearOff : 1;                                            // 0x008C(0x0001) BIT_FIELD Net, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bExchangedRoles : 1;                                     // 0x008C(0x0001) BIT_FIELD Transient, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bPendingNetUpdate : 1;                                   // 0x008D(0x0001) BIT_FIELD Transient, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bNetLoadOnClient : 1;                                    // 0x008D(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bNetUseOwnerRelevancy : 1;                               // 0x008D(0x0001) BIT_FIELD Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_V6IP[0x2];                                   // 0x008E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<float>                                              m_LODReplicationDistanceSqr;                             // 0x0090(0x0010) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic
		bool                                                       m_logLODReplication;                                     // 0x00A0(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_LHPN[0x13];                                  // 0x00A1(0x0013) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       bBlockInput : 1;                                         // 0x00B4(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       UnknownData_2HFR : 1;                                    // 0x00B4(0x0001) BIT_FIELD (PADDING)
		bool                                                       bAllowTickBeforeBeginPlay : 1;                           // 0x00B4(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       UnknownData_QGMM : 2;                                    // 0x00B4(0x0001) BIT_FIELD (PADDING)
		bool                                                       bActorEnableCollision : 1;                               // 0x00B4(0x0001) BIT_FIELD NoDestructor, NativeAccessSpecifierPrivate
		bool                                                       UnknownData_UT45 : 1;                                    // 0x00B4(0x0001) BIT_FIELD (PADDING)
		bool                                                       bReplicates : 1;                                         // 0x00B4(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_6GDE[0x3];                                   // 0x00B5(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                NetDriverName;                                           // 0x00B8(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		ENetRole                                                   RemoteRole;                                              // 0x00C0(0x0001) Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_94ZI[0x7];                                   // 0x00C1(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AActor*                                              Owner;                                                   // 0x00C8(0x0008) Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		struct FRepMovement                                        ReplicatedMovement;                                      // 0x00D0(0x0034) Edit, Net, DisableEditOnInstance, RepNotify, AdvancedDisplay, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_QTBH[0x4];                                   // 0x0104(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FRepAttachment                                      AttachmentReplication;                                   // 0x0108(0x0040) Net, Transient, RepNotify, ContainsInstancedReference, NativeAccessSpecifierPrivate
		ENetRole                                                   Role;                                                    // 0x0148(0x0001) Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_K65D[0x1];                                   // 0x0149(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		EAutoReceiveInput                                          AutoReceiveInput;                                        // 0x014A(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1E0V[0x1];                                   // 0x014B(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    InputPriority;                                           // 0x014C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UInputComponent*                                     InputComponent;                                          // 0x0150(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EInputConsumeOptions                                       InputConsumeOption;                                      // 0x0158(0x0001) ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_JWTP[0x3];                                   // 0x0159(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      NetCullDistanceSquared;                                  // 0x015C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    NetTag;                                                  // 0x0160(0x0004) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      NetUpdateTime;                                           // 0x0164(0x0004) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      NetUpdateFrequency;                                      // 0x0168(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MinNetUpdateFrequency;                                   // 0x016C(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      NetPriority;                                             // 0x0170(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      LastNetUpdateTime;                                       // 0x0174(0x0004) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bAutoDestroyWhenFinished : 1;                            // 0x0178(0x0001) BIT_FIELD BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bCanBeDamaged : 1;                                       // 0x0178(0x0001) BIT_FIELD Edit, BlueprintVisible, Net, SaveGame, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bActorIsBeingDestroyed : 1;                              // 0x0178(0x0001) BIT_FIELD Transient, DuplicateTransient, NoDestructor, NativeAccessSpecifierPrivate
